---
kind: property
id: P:Autodesk.Revit.DB.NumericRevisionSettings.Prefix
source: html/9a46a5d5-0ef5-886d-509e-59ef7381c82c.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.Prefix Property

The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType.

## Syntax (C#)
```csharp
public string Prefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null